; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	infrared3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon18)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon17)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet9)
)
(:goal (and
	(pointing satellite4 Phenomenon17)
	(have_image Star3 thermograph1)
	(have_image Planet4 thermograph1)
	(have_image Planet5 image0)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 image0)
	(have_image Star8 image0)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 image0)
	(have_image Phenomenon12 image0)
	(have_image Star13 thermograph1)
	(have_image Planet14 infrared3)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 thermograph1)
	(have_image Phenomenon17 spectrograph2)
	(have_image Phenomenon18 thermograph1)
	(have_image Star19 image0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 18
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 18
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 18
4. (turn_to satellite4 phenomenon17 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 phenomenon17)
   goals met: 1 of 18
5. (turn_to satellite3 star1 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 star1)
   goals met: 1 of 18
6. (calibrate satellite3 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 1 of 18
7. (turn_to satellite3 phenomenon10 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 18
8. (take_image satellite3 phenomenon10 instrument5 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 2 of 18
9. (turn_to satellite3 phenomenon16 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 18
10. (take_image satellite3 phenomenon16 instrument5 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 18
11. (turn_to satellite3 phenomenon17 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 phenomenon17)
   goals met: 3 of 18
12. (take_image satellite3 phenomenon17 instrument5 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 4 of 18
13. (turn_to satellite3 phenomenon18 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon18)
   goals met: 4 of 18
14. (take_image satellite3 phenomenon18 instrument5 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 5 of 18
15. (turn_to satellite3 phenomenon6 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 phenomenon6)
   goals met: 5 of 18
16. (take_image satellite3 phenomenon6 instrument5 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 6 of 18
17. (turn_to satellite3 planet14 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet14)
   goals met: 6 of 18
18. (take_image satellite3 planet14 instrument5 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 7 of 18
19. (turn_to satellite3 planet15 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet15)
   goals met: 7 of 18
20. (take_image satellite3 planet15 instrument5 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 8 of 18
21. (turn_to satellite3 planet4 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet4)
   goals met: 8 of 18
22. (take_image satellite3 planet4 instrument5 thermograph1)
   added: (have_image planet4 thermograph1)
   goals met: 9 of 18
23. (turn_to satellite3 planet9 planet4)
   deleted: (pointing satellite3 planet4)
   added: (pointing satellite3 planet9)
   goals met: 9 of 18
24. (take_image satellite3 planet9 instrument5 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 10 of 18
25. (turn_to satellite3 star13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star13)
   goals met: 10 of 18
26. (take_image satellite3 star13 instrument5 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 11 of 18
27. (turn_to satellite3 star3 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star3)
   goals met: 11 of 18
28. (take_image satellite3 star3 instrument5 thermograph1)
   added: (have_image star3 thermograph1)
   goals met: 12 of 18
29. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 12 of 18
30. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 12 of 18
31. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 12 of 18
32. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 12 of 18
33. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 13 of 18
34. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 13 of 18
35. (take_image satellite0 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 14 of 18
36. (turn_to satellite0 planet5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet5)
   goals met: 14 of 18
37. (take_image satellite0 planet5 instrument1 image0)
   added: (have_image planet5 image0)
   goals met: 15 of 18
38. (turn_to satellite0 star19 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star19)
   goals met: 15 of 18
39. (take_image satellite0 star19 instrument1 image0)
   added: (have_image star19 image0)
   goals met: 16 of 18
40. (turn_to satellite0 star7 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star7)
   goals met: 16 of 18
41. (take_image satellite0 star7 instrument1 image0)
   added: (have_image star7 image0)
   goals met: 17 of 18
42. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 17 of 18
43. (take_image satellite0 star8 instrument1 image0)
   added: (have_image star8 image0)
   goals met: 18 of 18
